[
  {
    "name": "人参",
    "description": "干燥根。主根呈纺锤形或圆柱形，表面灰黄色，上部有断续环纹。断面黄白色，显菊花纹。气特异，味微苦甘。大补元气，复脉固脱，补脾益肺。",
    "image": "images/renshen.png",
    "": "五加科植物人参的根，被誉为'百草之王'。含人参皂苷等活性成分，能增强免疫力、抗疲劳。野生人参称'野山参'，栽培品称'园参'。主要产于中国东北、韩国等地。"
  },
  {
    "name": "枸杞",
    "description": "干燥成熟果实。呈类纺锤形略扁，表面鲜红色或暗红色。果皮柔韧皱缩，种子20-50粒。味甜。滋补肝肾，益精明目。",
    "image": "images/gouqi.png",
    "knowledge": "茄科植物宁夏枸杞的果实，主产宁夏、甘肃等地。含枸杞多糖、甜菜碱等成分，具有抗氧化、保护视力作用。日常可泡茶、煮粥食用，但感冒发热时不宜服用。"
  },
  {
    "name": "当归",
    "description": "干燥根。主根粗短，支根数条。表面黄棕色，有纵皱纹。断面黄白色，有棕色环纹。有浓郁香气，味甘辛。补血活血，调经止痛。",
    "image": "images/danggui.png",
    "knowledge": "伞形科植物当归的根，主产甘肃岷县（称'岷归'）。含挥发油、阿魏酸等，被称为'血中圣药'。常用于妇科调经，但便溏者慎用。传统有'归头止血，归身补血，归尾破血'之说。"
  },
  {
    "name": "黄芪",
    "description": "干燥根。圆柱形，表面淡棕黄色。质硬韧，断面纤维性强。味微甜，嚼之有豆腥味。补气升阳，益卫固表。",
    "image": "images/huangqi.png",
    "knowledge": "豆科植物蒙古黄芪或膜荚黄芪的根，主产山西、内蒙古。含黄芪多糖、黄酮类成分，可增强免疫力、保护心血管。常与当归配伍（当归补血汤），但表实邪盛者不宜。"
  },
  {
    "name": "茯苓",
    "description": "干燥菌核。类球形或不规则块状。表面棕褐色，粗糙。体重质坚，断面白色细腻。味淡。利水渗湿，健脾宁心。",
    "image": "images/fuling.png",
    "knowledge": "多孔菌科真菌茯苓的菌核，寄生于松树根部。主产云南、安徽。含β-茯苓聚糖等，具有利尿、镇静作用。按部位分'茯苓皮'（利水）、'赤茯苓'（清热）、'白茯苓'（健脾）。"
  },
  {
    "name": "白术",
    "description": "干燥根茎。不规则肥厚团块，表面灰黄色。断面黄白色，有棕黄色油室散在。气清香，味甘微辛。健脾益气，燥湿利水。",
    "image": "images/baizhu.png",
    "knowledge": "菊科植物白术的根茎，主产浙江（称'浙术'）。含挥发油、白术内酯等，能调节胃肠功能。与苍术区别在于白术偏补脾，苍术偏燥湿。阴虚内热者慎用。"
  },
  {
    "name": "白芍",
    "description": "干燥根。圆柱形，表面类白色。质坚实，断面角质样。味微苦酸。养血调经，敛阴止汗。",
    "image": "images/baishao.png",
    "knowledge": "毛茛科植物芍药的根，主产浙江、安徽。含芍药苷等成分，具有镇痛、抗炎作用。与赤芍区别：白芍为栽培品经去皮煮制，偏补；赤芍为野生品，偏泻。"
  },
  {
    "name": "川芎",
    "description": "干燥根茎。不规则结节状拳形团块。表面黄褐色，有波状环纹。香气浓郁，味苦辛。活血行气，祛风止痛。",
    "image": "images/chuangxiong.png",
    "knowledge": "伞形科植物川芎的根茎，主产四川（故名'川芎'）。含川芎嗪、阿魏酸等，能扩张血管、抗血栓。为头痛要药，但阴虚火旺者慎用。与当归配伍增强活血功效。"
  },
  {
    "name": "熟地黄",
    "description": "炮制加工品。不规则块状，表面乌黑色。质柔软，断面乌黑油润。味甜。补血滋阴，益精填髓。",
    "image": "images/shudihuang.png",
    "knowledge": "玄参科植物地黄的块根经酒炖或蒸制而成。主产河南（怀庆地黄）。含梓醇、地黄素等，可促进造血功能。与生地黄区别：熟地偏补血滋阴，生地偏清热凉血。"
  },
  {
    "name": "金银花",
    "description": "干燥花蕾。棒状略弯曲，表面黄白色。开放者花冠筒状，先端二唇形。气清香，味淡微苦。清热解毒，疏散风热。",
    "image": "images/jinyinhua.png",
    "knowledge": "忍冬科植物忍冬的花蕾，因花色由白转黄得名。含绿原酸、木犀草苷等，具有广谱抗菌作用。为'双黄连口服液'主要成分之一，脾胃虚寒者慎用。"
  },
  {
    "name": "黄连",
    "description": "干燥根茎。弯曲如鸡爪，表面灰黄色。断面鲜黄色，味极苦。清热燥湿，泻火解毒。",
    "image": "images/huanglian.png",
    "knowledge": "毛茛科植物黄连的根茎，主产重庆石柱（'味连'）。含小檗碱（黄连素），对痢疾杆菌有抑制作用。过服易伤脾胃，常与干姜配伍以制其寒性。"
  },
  {
    "name": "丹参",
    "description": "干燥根。根茎粗短，根数条。表面棕红色，有纵皱纹。断面有放射状纹理。味微苦涩。活血祛瘀，通经止痛。",
    "image": "images/danshen.png",
    "knowledge": "唇形科植物丹参的根，因色红得名。含丹参酮、丹酚酸等，可改善微循环、抗心肌缺血。'一味丹参饮，功同四物汤'，但出血倾向者慎用。"
  },
  {
    "name": "三七",
    "description": "干燥根。类圆锥形或圆柱形。表面灰褐色，有断续纵皱纹。断面灰绿色，味苦回甜。散瘀止血，消肿定痛。",
    "image": "images/sanqi.png",
    "knowledge": "五加科植物三七的根，主产云南文山。含三七皂苷、黄酮等，具有'止血不留瘀'的特点。又名'田七'，可内服外敷，但孕妇慎用。与人参同科，均有补益作用。"
  },
  {
    "name": "天麻",
    "description": "干燥块茎。椭圆形略扁。表面黄白色，有纵皱纹。断面角质样，味甘。平肝息风，祛风通络。",
    "image": "images/tianma.png",
    "knowledge": "兰科植物天麻的块茎，需与蜜环菌共生生长。含天麻素、香荚兰醇等，对眩晕、头痛有良效。鉴别特征：顶端有红棕色'鹦哥嘴'，底部有圆脐形疤痕。"
  },
  {
    "name": "何首乌",
    "description": "干燥块根。团块状或不规则纺锤形。表面红棕色，皱缩不平。断面有云锦花纹。味微苦甘涩。解毒消痈，润肠通便。",
    "image": "images/heshouwu.png",
    "knowledge": "蓼科植物何首乌的块根，制首乌可补肝肾。含蒽醌类成分，生用通便，制用补益。注意：长期大量服用可能致肝损伤，需遵医嘱使用。"
  },
  {
    "name": "杜仲",
    "description": "干燥树皮。板片状，外表面淡棕色。断面有银白色橡胶丝相连。味微苦。补肝肾，强筋骨。",
    "image": "images/duzhong.png",
    "knowledge": "杜仲科植物杜仲的树皮，以扯断时出现白色胶丝为鉴别特征。含杜仲胶、绿原酸等，具有降压、强筋骨作用。炒炭后降压效果更佳。"
  },
  {
    "name": "冬虫夏草",
    "description": "麦角菌科真菌寄生在蝙蝠蛾幼虫上的子座及幼虫尸体的复合体。虫体似蚕，表面深黄色。子座细长圆柱形。气微腥，味微苦。补肺益肾，止血化痰。",
    "image": "images/dongchongxiacao.png",
    "knowledge": "名贵滋补品，主产青藏高原。含虫草酸、虫草素等，可调节免疫功能。正品特征：'虫'部有8对足（中部4对明显），'草'部顶端膨大。因资源稀缺，现已有人工培育品。"
  },
  {
    "name": "川贝母",
    "description": "干燥鳞茎。类圆锥形，表面类白色。清热润肺，化痰止咳。",
    "image": "images/chuanbeimu.png",
    "knowledge": "百合科植物川贝母的鳞茎，主产四川、西藏。按形态分'松贝'（怀中抱月）、'青贝'、'炉贝'。含生物碱，对肺燥咳嗽效果好，常与梨同炖（川贝炖雪梨）。"
  },
  {
    "name": "淫羊藿",
    "description": "干燥叶，表面绿色或黄绿色，用于补肾壮阳",
    "image": "images/yinyanghuo.png",
    "knowledge": "小檗科植物淫羊藿的叶，又名'仙灵脾'。含淫羊藿苷等，能增强性功能、改善骨质疏松。常与肉苁蓉、巴戟天配伍治疗肾阳虚，但阴虚火旺者忌用。"
  },
  {
    "name": "阳起石",
    "description": "矿石。呈长条形或扁长形，大小不一。表面灰白色、浅绿色至暗绿色，具纤维状纹理。体重质松，易纵向撕裂，断面呈纤维状。气微，味淡。温肾壮阳，主治阳痿精冷、腰膝冷痹。",
    "image": "images/yangqishi.png",
    "knowledge": "硅酸盐类矿物阳起石或阳起石石棉的矿石。主要成分为含水硅酸钙镁铁。使用时多煅淬炮制，增强壮阳效果。因含有石棉成分，现代临床已较少内服，多外用。"
  },
  {
    "name": "蒲公英",
    "description": "干燥全草。根圆锥形，表面棕褐色。叶基生，多皱缩破碎，完整叶片呈倒披针形，边缘羽状分裂。头状花序顶生，花冠黄褐色或淡黄白色。气微，味微苦。清热解毒，消肿散结，利尿通淋。主治乳痈、疔疮肿毒。",
    "image": "images/pugongying.png",
    "knowledge": "菊科植物蒲公英的全草，广泛分布于北半球。含蒲公英甾醇、菊糖等，被称为'天然抗生素'。可鲜品捣敷治乳腺炎，嫩叶可做野菜食用。脾胃虚寒者不宜过量服用。"
  }
]